# 4378

# or 오류 문자열, 정상 문자열 2개 만들어서 index로 해결하든가.

import sys

kb = {'1':'`', '2':'1', '3':'2', '4':'3', '5':'4', '6':'5', '7':'6', '8':'7', '9':'8', '0':'9', '-':'0', '=':'-',
      "W":"Q", 'E':'W', 'R':'E', 'T':'R', 'Y':'T', 'U':'Y', 'I':'U', 'O':'I', 'P':'O', '[':'P', ']':'[', "\\":']',
      'S':'A', 'D':'S', 'F':'D', "G":'F', 'H':'G', 'J':'H', 'K':'J', 'L':'K', ';':'L', "'":';',
      'X':'Z', 'C':'X', 'V':'C', 'B':'V', 'N':'B', 'M':'N', ',':'M', '.':',', '/':'.',
      " ":" "}

while (1):
    ipt = sys.stdin.readline().replace("\n", "")
    if (ipt == ""):
        break

    new = ""
    for letter in ipt:
        new += kb[letter]

    print(new)
